Revit 2024 API
PanelScheduleView.IsColumnInLoadSummary Method
 Check if this column in the load summary
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsColumnInLoadSummary(
	int nCol
)
Visual Basic
Public Function IsColumnInLoadSummary ( _
	nCol As Integer _
) As Boolean
Visual C++
public:
bool IsColumnInLoadSummary(
	int nCol
)
Parameters
nCol
Type: System.Int32
 Column Number
Return Value
 Check if this column in the load summary
See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace